app/views/tasks/create.jbuilder

    json.completed  @task.completed
    json.created_at @task.created_at
---
INSERT INTO "tasks" ("created_at", "updated_at", "content") VALUES (?, ?, ?)  [["created_at", "2022-07-19 11:57:39.059935"], ["updated_at", "2022-07-19 11:57:39.059935"], ["content", "finish the 3 remaning tests"]]