app/views/tasks/update.jbuilder

UPDATE "tasks" SET "updated_at" = ?, "completed" = ? WHERE "tasks"."id" = ?  [["updated_at", "2022-07-19 12:55:14.312237"], ["completed", 1], ["id", 1]]
---
    json.created_at @task.created_at
    json.updated_at @task.updated_at