app/controllers/tasks_controller.rb

  def create
    @task = Task.new(tasks_params)

    if @task.save
---
INSERT INTO "tasks" ("created_at", "updated_at", "content") VALUES (?, ?, ?)  [["created_at", "2022-07-19 11:57:39.059935"], ["updated_at", "2022-07-19 11:57:39.059935"], ["content", "finish the 3 remaning tests"]]

  def destroy
    @task = Task.find_by(id: params[:id])

    if @task and @task.destroy
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]

  def mark_complete
    @task = Task.find_by(id: params[:id])

    if @task and @task.update(completed: true)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = ?, "completed" = ? WHERE "tasks"."id" = ?  [["updated_at", "2022-07-19 12:48:04.293107"], ["completed", 1], ["id", 2]]

  def mark_active
    @task = Task.find_by(id: params[:id])

    if @task and @task.update(completed: false)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = ?, "completed" = ? WHERE "tasks"."id" = ?  [["updated_at", "2022-07-19 12:55:15.845075"], ["completed", 0], ["id", 1]]